InformationRegisters/СтатусыПроверкиИПодбораДокументовИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПроверкиИПодбораДокументовИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеПроверкиИПодбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроверкиИПодбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиИПодбораИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТребуемоеДействиеЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТребуемоеДействиеДокументЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидМаркируемойПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Ключ таблицы штрихкодов упаковок (если их несколько)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыПроверкиИПодбораДокументовИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЕстьЗаписиВРегистре(Документ, Сценарий) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(Документ);
	Набор.Отбор.Сценарий.Установить(Сценарий);

	Набор.Прочитать();

	Возврат Набор.Количество() > 0;

КонецФункции

Процедура ВосстановитьИзАрхива(Документ, Сценарий) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(Документ);
	Набор.Отбор.Сценарий.Установить(Сценарий);
	
	Набор.Записать();

КонецПроцедуры

// Выполняет запись в регистр промежуточных результатов проверки и подбора документа.
// 
// Параметры:
// 	ПроверяемыйДокумент    - ДокументСсылка - документ, в котором выполняется проверка и/или подбор.
// 	Сценарий               - Число - ключ сценария проверки.
//
Процедура ОчиститьРезультатыПроверкиДокумента(ПроверяемыйДокумент, Сценарий = 0) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ПроверяемыйДокумент);
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

// Выполняет запись в регистр промежуточных результатов проверки и подбора документа.
// 
// Параметры:
// 	ПроверяемыйДокумент     - ДокументСсылка - документ, в котором выполняется проверка и/или подбор.
// 	ДанныеПроверкиИПодбора  - ХранилищеЗначения - промежуточные результаты проверки.
// 	Сценарий                - Число - ключ сценария проверки.
//
Процедура СохранитьПромежуточныеРезультатыПроверкиДокумента(
	ПроверяемыйДокумент,
	ДанныеПроверкиИПодбора,
	Сценарий = 0) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ПроверяемыйДокумент);
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Документ                = ПроверяемыйДокумент;
	НоваяЗапись.Сценарий                = Сценарий;
	НоваяЗапись.ДанныеПроверкиИПодбора  = ДанныеПроверкиИПодбора;
	НоваяЗапись.СтатусПроверкиИПодбора  = Перечисления.СтатусыПроверкиИПодбораИС.Выполняется;
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

// Выполняет запись в регистр, отражующую завершение проверки и подбора документа.
// 
// Параметры:
// 	ПроверяемыйДокумент     - ДокументСсылка - документ, в котором выполнялась проверка и/или подбор.
// 	ДанныеПроверкиИПодбора  - ХранилищеЗначения, Неопределено - для входящих документов результаты проверки сохраняются,
// 	   для исходящих документов нет.
// 	ТребуемоеДействиеЭДО    - ПеречислениеСсылка.ТребуемоеДействиеДокументЭДО - действие, которое нужно выполнить с документом ЭДО.
// 	Сценарий                - Число - ключ сценария проверки.
//
Процедура ОтразитьЗавершениеПроверкиДокумента(
	ПроверяемыйДокумент,
	ДанныеПроверкиИПодбора,
	ТребуемоеДействиеЭДО = Неопределено,
	Сценарий = 0) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ПроверяемыйДокумент);
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Документ                = ПроверяемыйДокумент;
	НоваяЗапись.Сценарий                = Сценарий;
	НоваяЗапись.ДанныеПроверкиИПодбора  = ДанныеПроверкиИПодбора;
	НоваяЗапись.СтатусПроверкиИПодбора  = Перечисления.СтатусыПроверкиИПодбораИС.Завершено;
	НоваяЗапись.ТребуемоеДействиеЭДО    = ТребуемоеДействиеЭДО;
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

// Выполняет запись в регистр, отражующую возобновление проверки и подбора документа.
// 
// Параметры:
//   ПроверяемыйДокумент - ДокументСсылка - документ, в котором выполнялась проверка и/или подбор.
//   Сценарий                - Число - ключ сценария обработки
// 
// Возвращаемое значение:
//   Булево - запись в регистре проверки и подбора выполнена
//
Функция ОтразитьВозобновлениеПроверкиДокумента(ПроверяемыйДокумент, Сценарий) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ПроверяемыйДокумент);
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Запись.СтатусПроверкиИПодбора = Перечисления.СтатусыПроверкиИПодбораИС.Выполняется;
		Запись.ТребуемоеДействиеЭДО   = Перечисления.ТребуемоеДействиеДокументЭДО.ПустаяСсылка();
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать(Истина);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти

#КонецЕсли
